/*! ES6__10__modules.js @ 2017, yamoo9@naver.com */


/////////////
// Modules //
/////////////


// ES5(Browser Web) //

// IIFE 패턴
// 캡슐화

// 노출 패턴
// 캡슐화
// 재사용


// 클라이언트 환경 모듈 실습 + 모듈 패턴(IIFE/Revealing Module)


// ---------------------------------------------------------------------------------


// 모듈 포맷
// - 모듈 포맷은 모듈을 정의하기 위해 사용할 수 있는 문법이다.

// CommonJS //


// AMD //


// UMD //


// ES6 //







/// Conclusion ////////////////////////////////////////////////////////////////

/**
 * ES6를 사용하여 프로젝트를 진행한다면?
 * Modules
 * import https://goo.gl/gQ6KPT
 * export https://goo.gl/VsEGFf
 * ———————————————————————————————————————————————————————————
 *
 * 모듈 단위 별, 독립 개발 지향
 * 주의! 현재 브라우저에서 제대로 지원이 안됨.
 * 모듈 로더 또는 번들러를 사용하여 프로젝트에 반영
 *
 * 권장 방식
 *  - ES6 export, import
 *  - Webpack
 *
 */