/*! ES6__13__set-map.js @ 2017, yamoo9@naver.com */


/////////
// Set //
/////////



/////////
// Map //
/////////







/// Conclusion ////////////////////////////////////////////////////////////////

/**
 * ES6를 사용하여 프로젝트를 진행한다면?
 * Set, Map
 *
 * Set     https://goo.gl/rLszbu
 * Map     https://goo.gl/DUs6c8
 * ———————————————————————————————————————————————————————————
 *
 * Set은 Array와 유사하나, 중복된 데이터를 허용하지 않아 데이터 관리에 유용
 * Map은 Object와 유사하나, 키로 어떤 값이든 사용 가능하며 데이터를 순환할 경우 유용
 * 즉, Set, Map은 데이터 관리에 매우 유용하니 적극 활용
 *
 */