/*! ES6__14__weakset-weakmap.js @ 2017, yamoo9@naver.com */


/////////////
// WeakSet //
/////////////



/////////////
// WeakMap //
/////////////







/// Conclusion ////////////////////////////////////////////////////////////////

/**
 * ES6를 사용하여 프로젝트를 진행한다면?
 * WeakSet, WeakMap
 *
 * WeakSet https://goo.gl/5viDqn
 * WeakMap https://goo.gl/VWqA2B
 * ———————————————————————————————————————————————————————————
 *
 * 약한 참조를 처리하는 위크세트, 위크맵은
 * 메모리 누수를 예방하는 처리 과정에 유용
 *
 * 특징
 * - 객체 유형만 저장 가능 (원시데이터 불가능)
 * - 열거(Enumerable) 불가능
 *
 */